# Process missing values

## Find the missing values

- Read the dataset titanic_survival.csv

- Count the number of values in the "age" column with missing values:
>- Assign to the variable age the column of ages of the dataframe titanic_survival
>- Use pandas.isnull() on the age variable to create a set of True and False values.
>- Use the resulting Series to select only the elements in the "age" column that are null and assign the result to the age_null variable.
>- Assign the number of missing values of age_null to the variable age_null_count (function len() )
- Display age_null_count to see the number of missing values in the column "age".

In [1]:
import pandas as pd

titanic_survival = pd.read_csv("titanic_survival.csv")

In [3]:
age = titanic_survival['age']
age_null = titanic_survival[age.isnull()]
age_null_count = len(age_null)
age_null_count

264

## Problem with missing values

- Use age_is_null to create a vector that contains only the values in the "age" column that are not NaN (i.e. for which age_is_null is False)
- Assign this result to the variable good_ages
- Calculate the mean of this new vector and assign the result to the variable mean_age
- Display this average.

In [4]:
good_ages = titanic_survival[age.notnull()]['age']
mean_age = good_ages.mean()
mean_age

29.8811345124283

## To calculate an average more simply ##

- Assign the mean of the column "fare" to the variable mean_fare.
- Display the result.

In [5]:
mean_fare = titanic_survival['fare'].mean()
mean_fare

33.29547928134572

## Calculate price statistics

- Create an empty dictionary called fares_by_class.
- Create the passenger_classes list which contains the elements [1,2,3].
- Use a for loop to browse the passenger_classes list:
>- Just select the titanic_survival lines for which the pclass column is equal to the temporary variable (the iterator) of the for loop, i.e. corresponding to the class number (1, 2 or 3).
>- Select only the fare column for this subset of rows (corresponding to the class).
>- Use the Series.mean() method to calculate the average of this subset
>- Add this calculated average of the class to the fares_by_class dictionary with the class number as a key (and therefore as a value the average price of the boarding ticket)
- Once the loop is complete, the fares_by_class dictionary should have 1,2 and 3 as keys with the corresponding averages as values.
- Display the result.

In [6]:
fares_by_class = {}
passenger_classes = [1,2,3]
for val in passenger_classes:    
    fares_by_class.update({val : titanic_survival.loc[titanic_survival['pclass'] == val]['fare'].mean()}) 
fares_by_class

{1: 87.50899164086687, 2: 21.1791963898917, 3: 13.302888700564957}

## Introduction to table pivots

- Use the dataFrame.pivot_table() method to calculate the average age for each passenger class ("pclass").
- Assign the result to the variable passenger_age.
- Display passenger_age.
- Do the same with the survived column for each passenger class.

In [7]:
import numpy as np
passenger_age = pd.pivot_table(titanic_survival, values='age', index='pclass')
passenger_age

              age
pclass
1.0     39.159918
2.0     29.506705
3.0     24.816367

In [8]:
passenger_survived = pd.pivot_table(titanic_survival, values='survived', index='pclass')
passenger_survived

        survived
pclass
1.0     0.619195
2.0     0.429603
3.0     0.255289

## Pivot Tables Level 2

- Make a pivot table that calculates the total money collected ("fare") and the total number of survivors ("survivved") for each boat port ("embarked"). You will have to use the numpy.sum function.
- Assign the result to the port_stats variable.
- Display the result.

In [9]:
port_stats = pd.pivot_table(titanic_survival, values=['survived', 'fare'], index='embarked', aggfunc=np.sum)
port_stats

                fare  survived
embarked
C         16830.7922     150.0
Q          1526.3085      44.0
S         25033.3862     304.0

## Eliminate missing values

- Delete all rows of titanic_survival for which the columns "age" or "sex" have missing values and assign the result to the variable new_titanic_survival.
- Compare the number of rows left with the shape attribute.

In [10]:
new_titanic_survival = titanic_survival.dropna(subset=["age", "sex"])
new_titanic_survival

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1301,3.0,0.0,"Youseff, Mr. Gerious",male,45.5000,0.0,0.0,2628,7.2250,NaN,C,NaN,312.0,NaN
1304,3.0,0.0,"Zabour, Miss. Hileni",female,14.5000,1.0,0.0,2665,14.4542,NaN,C,NaN,328.0,NaN
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",male,26.5000,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27.0000,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29.0000,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [11]:
print('Shape before dropping NAN Values: '+str(titanic_survival.shape))
print('Shape after dropping NAN Values: '+str(new_titanic_survival.shape))

Shape before dropping NAN Values: (1310, 14)
Shape after dropping NAN Values: (1046, 14)

## iloc to access lines

- Assign the first 10 lines of new_titanic_survival to the first_ten_rows variable.
- Assign the 5th line of new_titanic_survival to the row_position-fifth variable.
- Assign the row with index name 25 for new_titanic_survival to the variable row_index_25.

In [13]:
first_ten_rows = new_titanic_survival[0:10]
first_ten_rows

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1.0,1.0,"Anderson, Mr. Harry",male,48.0000,0.0,0.0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1.0,1.0,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1.0,0.0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1.0,0.0,"Andrews, Mr. Thomas Jr",male,39.0000,0.0,0.0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1.0,1.0,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2.0,0.0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1.0,0.0,"Artagaveytia, Mr. Ramon",male,71.0000,0.0,0.0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

In [14]:
row_position_fifth = new_titanic_survival.loc[5]
row_position_fifth

pclass                         1
survived                       1
name         Anderson, Mr. Harry
sex                         male
age                           48
sibsp                          0
parch                          0
ticket                     19952
fare                       26.55
cabin                        E12
embarked                       S
boat                           3
body                         NaN
home.dest           New York, NY
Name: 5, dtype: object

In [15]:
row_index_25 = new_titanic_survival.iloc[25]
row_index_25

pclass                             1
survived                           1
name         Bishop, Mr. Dickinson H
sex                             male
age                               25
sibsp                              1
parch                              0
ticket                         11967
fare                         91.0792
cabin                            B49
embarked                           C
boat                               7
body                             NaN
home.dest               Dowagiac, MI
Name: 26, dtype: object

## The column indexes

- Assign the row heading value 1100 for the "age" column of new_titanic_survival to the variable row_index_1100_age.
- Assign the row heading value 25 for the column "survived" in new_titanic_survival to the variable row_index_25_survived.
- Assign the first 5 rows and 3 columns of new_titanic_survival to the variable five_rows_three_cols.
- Display all results.

In [16]:
row_index_1100_age = new_titanic_survival.loc[1100]['age']
row_index_1100_age

29.0

In [17]:
row_index_25_survived = new_titanic_survival.loc[25]['survived']
row_index_25_survived

0.0

In [18]:
five_rows_three_cols = new_titanic_survival.iloc[:5, :3]
five_rows_three_cols

   pclass  survived                                             name
0     1.0       1.0                    Allen, Miss. Elisabeth Walton
1     1.0       1.0                   Allison, Master. Hudson Trevor
2     1.0       0.0                     Allison, Miss. Helen Loraine
3     1.0       0.0             Allison, Mr. Hudson Joshua Creighton
4     1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)

## Re-index the lines in a dataframe ##

- Re-index the new_titanic_survival dataframe so that the first line starts at 0 and remove the old indexing.
- Assign the result to the variable titanic_reindexed.
- Display the first 5 rows and first 3 columns of titanic_reindexed.

In [19]:
titanic_reindexed = new_titanic_survival.reindex()
titanic_reindexed.iloc[:5, :3]

   pclass  survived                                             name
0     1.0       1.0                    Allen, Miss. Elisabeth Walton
1     1.0       1.0                   Allison, Master. Hudson Trevor
2     1.0       0.0                     Allison, Miss. Helen Loraine
3     1.0       0.0             Allison, Mr. Hudson Joshua Creighton
4     1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)

## Applying functions to a DataFrame

- Write a function that counts the number of missing elements in a Series object.
- Use the DataFrame.apply() method to apply your function on titanic_survival.
- Assign the result to the variable column_null_count.
- Display the result.

In [20]:
def count_missing_values(df):    
    return df.isnull().sum()

In [21]:
column_null_count = titanic_survival.apply(count_missing_values)
column_null_count

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

## Apply a function to a line

- Create a function that returns the string "minor" for someone under 18 years old, "adult" if their age is 18 or older, and "unknown" if the value is missing.
- Use this function with the apply() method to find the correct title for each apssager in the titanic_survival dataframe.
- Assign the result to the age_labels variable.
- Display the result.

In [22]:
def age_group(df):    
    if df < 18.00:
        return 'Minor'
    elif df >= 18.00:
        return 'Adult'
    else:
        return 'unknown'

In [23]:
age_labels=titanic_survival['age'].apply(age_group)
age_labels

0         Adult
1         Minor
2         Minor
3         Adult
4         Adult
         ...
1305    unknown
1306      Adult
1307      Adult
1308      Adult
1309    unknown
Name: age, Length: 1310, dtype: object

## Practice: Calculate percent survival by age group

- Add the column "age_labels" to the dataframe titanic_survival containing the variable age_labels that we created before.
- Create a pivot table that calculates the average chance of survival (column "survived") for each age group (column "age_labels") in the dataframe titanic_survival.
- Assign the resulting Series object to the age_group_survival variable.
- Display the result.

In [24]:
titanic_survival['age_labels'] = age_labels
titanic_survival

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,age_labels
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",Adult
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",Minor
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",Minor
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",Adult
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",Adult
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1305,3.0,0.0,"Zabour, Miss. Thamine",female,NaN,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN,unknown
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",male,26.5000,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN,Adult
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27.0000,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN,Adult
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29.0000,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN,Adult
1309,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,unknown

In [25]:
age_group_survival = pd.pivot_table(titanic_survival, values='survived', index=['age_labels'])
age_group_survival

            survived
age_labels
Adult       0.387892
Minor       0.525974
unknown     0.277567